migrate to mermaid
