--- a/content/code/2019-08-24-drone-ci-travis-ci-to-azure-pipelines.md
+++ b/content/code/2019-08-24-drone-ci-travis-ci-to-azure-pipelines.md
@@ -129,60 +117,58 @@ Step2.2 --> Step2.3
 
 **Pipeline with two stages**
 
-```plantuml
-@startuml
-!includeurl https://gist.githubusercontent.com/anoff/d8f48105ac4d3c7b14ca8c34d6d54938/raw/7381f13a14e048bbd3cb4ecc70369e913908151a/anoff.plantuml
-[*] --> Stage1
-Stage1 --> Stage2
-Stage2 --> [*]
+```mermaid
+stateDiagram-v2
+  [*] --> Stage1
+  Stage1 --> Stage2
+  Stage2 --> [*]
 
-state Stage1 {
-  [*] --> Job1.1
-  [*] --> Job1.2
-  state Job1.1 {
-    [*] --> Step1.1.1
-    Step1.1.1 --> Step1.1.2
-  }
-  state Job1.2 {
-    [*] --> Step1.2.1
-    Step1.2.1 --> Step1.2.2
-    Step1.2.2 --> Step1.2.3
-    Step1.2.3 --> Step1.2.4
+  state Stage1 {
+    [*] --> Job1.1
+    [*] --> Job1.2
+    state Job1.1 {
+      [*] --> Step1.1.1
+      Step1.1.1 --> Step1.1.2
+    }
+    state Job1.2 {
+      [*] --> Step1.2.1
+      Step1.2.1 --> Step1.2.2
+      Step1.2.2 --> Step1.2.3
+      Step1.2.3 --> Step1.2.4
+    }
+
+    Step1.1.2 --> [*]
+    Step1.2.4 --> [*]
   }
 
-  Step1.1.2 --> [*]
-  Step1.2.4 --> [*]
-}
+  state Stage2 {
+    [*] --> Job2.1
+    [*] --> Job2.2
+    [*] --> Job2.3
 
-state Stage2 {
-  [*] --> Job2.1
-  [*] --> Job2.2
-  [*] --> Job2.3
-
-  state Job2.1 {
-    [*] --> Step2.1.1
-    Step2.1.1 --> Step2.1.2
+    state Job2.1 {
+      [*] --> Step2.1.1
+      Step2.1.1 --> Step2.1.2
+    }
+    state Job2.2 {
+      [*] --> Step2.2.1
+    }
+    state Job2.3 {
+      [*] --> Step2.3.1
+      Step2.3.1 --> Step2.3.2
+      Step2.3.2 --> Step2.3.3
+    }
+    Step2.1.2 --> [*]
+    Step2.2.1 --> [*]
+    Step2.3.3 --> [*]
   }
-  state Job2.2 {
-    [*] --> Step2.2.1
-  }
-  state Job2.3 {
-    [*] --> Step2.3.1
-    Step2.3.1 --> Step2.3.2
-    Step2.3.2 --> Step2.3.3
-  }
-  Step2.1.2 --> [*]
-  Step2.2.1 --> [*]
-  Step2.3.3 --> [*]
-}
-@enduml
 ```
 
 ## Migrating from drone to Azure Pipelines 🚐
